[
  {
    "id": 100001,
    "title": "Incident Response Playbook",
    "description": "Standard operating procedures for detecting, analyzing, and responding to cybersecurity incidents.",
    "createdAt": 1700000000000,
    "updatedAt": 1700000000000,
    "sections": [
      {
        "id": 100101,
        "title": "Phase 1: Detection & Analysis",
        "description": "Initial steps for identifying potential security incidents and gathering preliminary information.",
        "createdAt": 1700000001000,
        "updatedAt": 1700000001000,
        "entries": [
          {
            "id": 10010101,
            "title": "Alert Triage Checklist",
      "content": "<h3>Purpose:</h3>\nTo quickly assess the severity and validity of security alerts.\n\n<h3>Steps:</h3>\n<ol>\n  <li><b>Verify Alert Source:</b> Confirm the alert originated from a legitimate security tool (SIEM, EDR, Firewall).</li>\n  <li><b>Initial Context Gathering:</b>\n    <ul>\n      <li>What systems are involved (IPs, Hostnames)?</li>\n      <li>What user accounts are involved?</li>\n      <li>What time did the event occur?</li>\n      <li>What is the nature of the alert (e.g., malware detection, abnormal login, data exfiltration)?</li>\n    </ul>\n  </li>\n  <li><b>False Positive Analysis:</b> Is this a known benign activity or a misconfiguration? Check baselines.</li>\n  <li><b>Severity Assessment:</b> Assign a preliminary severity (Low, Medium, High, Critical) based on potential impact and confidence.</li>\n  <li><b>Escalation Path:</b> Based on severity, follow the defined escalation matrix.</li>\n</ol>\n\n<p><b>Recommendation:</b> Automate as much of the initial context gathering as possible using SOAR playbooks.</p>",
            "tags": ["detection", "ir", "checklist", "triage", "siem", "edr"],
            "references": "NIST SP 800-61 Rev. 2, SANS Incident Handler's Handbook",
            "createdAt": 1700000001001,
            "updatedAt": 1700000001001
          },
          {
            "id": 10010102,
            "title": "Initial Malware Identification",
            "content": "<h3>Objective:</h3>\nDetermine if suspicious files are malicious and their basic characteristics.\n\n<h3>Tools & Techniques:</h3>\n<ul>\n  <li><b>VirusTotal:</b> Upload suspicious hashes/files for multi-AV scan and community insights.<br><img src=\"https://via.placeholder.com/600x300?text=VirusTotal+Screenshot\" alt=\"VirusTotal Scan Example\"></li>\n  <li><b>Hybrid Analysis:</b> For dynamic analysis (sandboxing) of executables and documents.<br><a href=\"https://www.hybrid-analysis.com/\" target=\"_blank\">Hybrid Analysis Website</a></li>\n  <li><b>Strings Utility:</b> Extract readable strings from binaries (useful for IOCs, paths, URLs).\n<pre><code class=\"language-bash\">\nstrings /path/to/malicious_file.exe | grep -E 'http|ftp|ssh|.onion'\n</code></pre>\n  </li>\n  <li><b>YARA Rules:</b> Apply existing YARA rules or write new ones to identify malware families.</li>\n</ul>\n\n<p><b>Tip:</b> Always handle suspicious files in a controlled, isolated environment (e.g., a dedicated analysis VM).</p>",
            "tags": ["malware-analysis", "detection", "ir", "tools", "virustotal", "sandbox"],
            "references": "VirusTotal.com, Hybrid-Analysis.com, YARA Documentation",
            "createdAt": 1700000001002,
            "updatedAt": 1700000001002
          }
        ]
      },
      {
        "id": 100102,
        "title": "Phase 2: Containment",
        "description": "Steps to limit the scope and impact of an incident.",
        "createdAt": 1700000002000,
        "updatedAt": 1700000002000,
        "entries": [
          {
            "id": 10010201,
            "title": "Network Isolation Strategies",
            "content": "<h3>Purpose:</h3>\nPrevent lateral movement and C2 communication from compromised systems.\n\n<h3>Methods:</h3>\n<ol>\n  <li><b>Logical Isolation:</b>\n    <ul>\n      <li>Disable network adapters on affected hosts.</li>\n      <li>Apply host-based firewall rules to block suspicious traffic.</li>\n      <li>Move compromised systems to a quarantined VLAN or network segment.</li>\n    </ul>\n  </li>\n  <li><b>Physical Isolation:</b> (Last resort, consider forensic implications)\n    <ul>\n      <li>Unplug network cables from affected devices.</li>\n    </ul>\n  </li>\n</ol>\n\n<pre><code class=\"language-powershell\">\n# Example PowerShell to disable network adapter\nGet-NetAdapter -Name \"Ethernet\" | Disable-NetAdapter -Confirm:$false\n\n# Example for Windows Firewall (block all outbound except to IR server)\nNetsh advfirewall firewall add rule name=\"BlockAllOutbound\" dir=out action=block enable=yes\nNetsh advfirewall firewall add rule name=\"AllowIROutbound\" dir=out action=allow remoteip=192.168.1.100 enable=yes\n</code></pre>\n\n<p><b>Important:</b> Always document actions taken and their timestamp. Ensure isolated systems can still be accessed by IR tools if needed.</p>",
            "tags": ["containment", "ir", "network-security", "powershell"],
            "references": "NIST SP 800-61 Rev. 2, CIS Controls v8",
            "createdAt": 1700000002001,
            "updatedAt": 1700000002001
          }
        ]
      }
    ]
  },
  {
    "id": 100002,
    "title": "Threat Hunting Playbook",
    "description": "Proactive methodologies for discovering unseen threats within the network environment.",
    "createdAt": 1700000003000,
    "updatedAt": 1700000003000,
    "sections": [
      {
        "id": 100201,
        "title": "Hunting for Persistence Mechanisms",
        "description": "Strategies to uncover how adversaries maintain access to systems.",
        "createdAt": 1700000004000,
        "updatedAt": 1700000004000,
        "entries": [
          {
            "id": 10020101,
            "title": "Sysmon Rule for Run Keys",
            "content": "Sysmon is invaluable for endpoint visibility. You can use it to hunt for suspicious modifications to common Windows persistence locations like Run keys.\n\n<h3>Sysmon Configuration Snippet:</h3>\n<pre><code class=\"language-xml\">\n&lt;!-- Detects modifications to Run, RunOnce, RunServices, etc. --&gt;\n&lt;RuleGroup name=\"Persistence_RunKeys\" groupRelation=\"or\"&gt;\n  &lt;RegistryEvent onmatch=\"exclude\"&gt;\n    &lt;TargetObject name=\"Sysmon service startup\" condition=\"contains\"&gt;HKLM\\System\\CurrentControlSet\\Services\\SysmonDrv\\&lt;/TargetObject&gt;\n  &lt;/RegistryEvent&gt;\n\n  &lt;RegistryEvent onmatch=\"include\"&gt;\n    &lt;TargetObject condition=\"contains\"&gt;HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run&lt;/TargetObject&gt;\n    &lt;TargetObject condition=\"contains\"&gt;HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run&lt;/TargetObject&gt;\n    &lt;TargetObject condition=\"contains\"&gt;HKLM\\Software\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\\Run&lt;/TargetObject&gt;\n    &lt;TargetObject condition=\"contains\"&gt;HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce&lt;/TargetObject&gt;\n    &lt;TargetObject condition=\"contains\"&gt;HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce&lt;/TargetObject&gt;\n  &lt;/RegistryEvent&gt;\n&lt;/RuleGroup&gt;\n</code></pre>\n\n<p><b>Note:</b> This is a basic example. Real-world Sysmon configurations are far more complex and require careful tuning to avoid false positives.</p>",
            "tags": ["sysmon", "persistence", "threat-hunting", "windows", "xml", "configuration"],
            "references": "Sysmon documentation, Sysmon-Modular by Olaf Hartong",
            "createdAt": 1700000004001,
            "updatedAt": 1700000004001
          }
        ]
      }
    ]
  },
  {
    "id": 100003,
    "title": "OSINT for Cybercriminal Tracking",
    "description": "A comprehensive guide to leveraging open-source intelligence for identifying, tracking, and understanding cybercriminals.",
    "createdAt": 1700000005000,
    "updatedAt": 1700000005000,
    "sections": [
      {
        "id": 100301,
        "title": "Phase 1: Initial Footprinting & Alias Discovery",
        "description": "Techniques for starting an investigation, gathering initial data points, and uncovering aliases across various online sources.",
        "createdAt": 1700000005001,
        "updatedAt": 1700000005001,
        "entries": [
          {
            "id": 10030101,
            "title": "1.1 Username & Email Enumeration",
            "content": "<h3>Purpose:</h3>\nTo identify associated online accounts and potential aliases from a known username or email address. This forms the bedrock of most digital investigations, helping to map a suspect's online presence.\n\n<h3>Key Tools & Techniques:</h3>\n<ol>\n  <li><b>Social Media & Forum Searches:</b>\n    <ul>\n      <li>Use dedicated OSINT tools (e.g., OSINT Framework, WhatsMyName, Sherlock) to search for usernames across hundreds of platforms simultaneously. These tools automate the process of checking for username availability on various sites, providing a quick overview of potential matches.</li>\n      <li>Manually search popular platforms (Facebook, X/Twitter, Instagram, Reddit, GitHub, LinkedIn) for the username. Pay attention to profile descriptions, connected accounts, and posting history.</li>\n      <li>Look for patterns in username usage across different sites (e.g., 'cyber_dude_123' might become 'cyberdude123', 'CyberDude', or 'cyberdude_official' elsewhere). Criminals often adapt usernames slightly for different platforms.</li>\n    </ul>\n  </li>\n  <li><b>Email Enumeration:</b>\n    <ul>\n      <li>Use services like Hunter.io, Skymem, or similar for domain-based email searches. These can reveal publicly available email addresses associated with a specific domain or organization.</li>\n      <li>Check for breached password databases (e.g., Have I Been Pwned) to see if an email appears in known breaches. This can reveal associated usernames, old passwords, or other leaked data, providing crucial links.</li>\n      <li>Utilize Google Dorks: `site:example.com intext:email@domain.com` or `\"email@domain.com\" filetype:pdf` to find emails embedded in documents or websites.</li>\n    </ul>\n  </li>\n  <li><b>Gravatar & Profile Picture Analysis:</b>\n    <ul>\n      <li>Upload suspect profile pictures to reverse image search engines (Google Images, TinEye, Yandex, PimEyes for facial recognition). This can lead to other profiles where the same image is used.</li>\n      <li>Check Gravatar profiles by hashing the email address; Gravatar often links to other social media, blogs, or forums where the user has commented.</li>\n    </ul>\n  </li>\n</ol>\n\n<p><b>Use Case:</b> Investigating a threat actor who left a username 'ShadowBrokerXX' on a dark web forum. Use enumeration tools to find if this username is active on GitHub (for code contributions), Reddit (for discussions), or Twitter (for public posts), potentially revealing their real identity or further aliases.</p>\n\n<p><b>Advice/Recommendation:</b> Document every hit, even if seemingly insignificant. Small data points can connect later to form a larger picture. Use spreadsheets or dedicated case management tools (like the 'Investigation Notes' or 'Multi-Vault' in ThreatNet) to organize findings. Prioritize tools that provide historical data or broader coverage.</p>\n\n<p><b>Tips/Tricks:</b></p>\n<ul>\n  <li><b>Leet Speak Variations:</b> Consider common 'leet speak' or number substitutions (e.g., 'cr4cker', 'h4ck3r') when searching for usernames.</li>\n  <li><b>Case Sensitivity:</b> Some platforms are case-sensitive; try all common variations (e.g., `username`, `Username`, `USERNAME`).</li>\n  <li><b>Associated Data:</b> If an email is found, try registering on various services with that email to see if it's already in use. <strong>(Caution: Do not proceed if it implies agreeing to terms of service you don't intend to abide by, or if it creates an unwanted digital trail).</strong></li>\n  <li><b>Timeline Analysis:</b> Note the creation dates of found accounts. This can help establish a timeline of the cybercriminal's activity.</li>\n</ul>\n\n<p><b>Alerts (What to be Safe From):</b></p>\n<ul>\n  <li><b>OpSec Failures:</b> Be mindful of your own operational security. Always use a secure, isolated environment (VM, VPN, Tor if necessary) for OSINT investigations to avoid revealing your own identity, IP address, or infrastructure to targets.</li>\n  <li><b>Clicking Malicious Links:</b> Exercise extreme caution with any links found during enumeration, especially on suspicious forums or dark web content. Never click them directly without sandboxing or analysis.</li>\n  <li><b>Data Contamination:</b> Avoid directly interacting with suspicious infrastructure or accounts from your primary investigative environment. Keep your tools and data segregated.</li>\n  <li><b>Legal Boundaries:</b> Understand and adhere to the legal and ethical boundaries of OSINT in your jurisdiction. Do not engage in activities that constitute hacking, unauthorized access, or doxing.</li>\n</ul>",
            "tags": ["osint", "cybercrime", "username-enumeration", "email-investigation", "social-media", "reconnaissance", "tools", "best-practice", "opsec"],
            "references": "OSINT Framework, WhatsMyName, Sherlock, Hunter.io, Have I Been Pwned, Google Images, TinEye, Yandex, PimEyes, Gravatar",
            "createdAt": 1700000005002,
            "updatedAt": 1700000005002
          },
          {
            "id": 10030102,
            "title": "1.2 Domain & IP Footprinting",
            "content": "<h3>Objective:</h3>\nTo uncover infrastructure associated with cybercriminal activities, such as Command and Control (C2) servers, phishing sites, staging servers, or personal websites. This helps to map the adversary's digital infrastructure.\n\n<h3>Methodologies:</h3>\n<ol>\n  <li><b>WHOIS & Reverse WHOIS Lookups:</b>\n    <ul>\n      <li>Search WHOIS records for registration details of suspect domains. Look for unusual registrars (e.g., those known for abuse), excessive privacy protection (especially for new domains), or repeat contact information (email, name, phone) that could link multiple domains.</li>\n      <li>Perform reverse WHOIS searches using unique data points (email, name, phone, address) found in WHOIS records to uncover other domains registered by the same entity. This is powerful for identifying networks of related malicious sites.</li>\n      <li>Tools: `whois` command-line utility, WhoisXMLAPI, DomainTools, ViewDNS.info.</li>\n    </ul>\n  </li>\n  <li><b>Passive DNS Analysis:</b>\n    <ul>\n      <li>Query passive DNS (pDNS) databases (e.g., Farsight DNSDB, RiskIQ PassiveTotal, VirusTotal's Passive DNS tab) to see historical IP addresses for a given domain or historical domains associated with a specific IP address.</li>\n      <li>This is crucial for identifying shared infrastructure, even if IP addresses change frequently or domains are rotated, and can reveal staging servers or older C2s.</li>\n    </ul>\n  </li>\n  <li><b>SSL Certificate Analysis:</b>\n    <ul>\n      <li>SSL/TLS certificates contain fields like 'Common Name' and 'Subject Alternative Name' (SAN) which list domains. Searching Certificate Transparency (CT) logs can reveal all domains that have ever been issued a certificate by specific Certificate Authorities, or domains linked by the same certificate.</li>\n      <li>Cybercriminals often reuse certificates across different malicious infrastructure (e.g., multiple phishing sites for the same campaign) due to cost or laziness.</li>\n      <li>Tools: Censys, Shodan, crt.sh (Certificate Transparency Log search).</li>\n    </ul>\n  </li>\n  <li><b>Hosting Provider & Network Block Analysis:</b>\n    <ul>\n      <li>Identify the hosting provider (e.g., DigitalOcean, OVH, VPN.ac, bulletproof hosting services). Look for providers known to tolerate malicious activity.</li>\n      <li>Perform IP range scans or lookups (e.g., using Censys, Shodan, AbuseIPDB) to check for other suspicious domains or services hosted on the same IP block or Autonomous System (AS) number. This can expose sub-networks controlled by the same actor.</li>\n    </ul>\n  </li>\n  <li><b>Website & Web Content Archiving:</b>\n    <ul>\n      <li>Use services like Archive.org's Wayback Machine, Archive.today, or Google Cache to view historical versions of websites. This can reveal previous content, error pages, or changes in infrastructure.</li>\n      <li>Look for clues left behind before a site was taken down or altered.</li>\n    </ul>\n  </li>\n</ol>\n\n<pre><code class=\"language-bash\">\n# Example: Querying whois for a domain in the terminal\nwhois cybercriminal-phish.ru\n\n# Example: Searching Censys for domains associated with a specific SSL certificate issuer\ncensys search \"parsed.issuer_dn: 'CN=Let\\'s Encrypt, O=Let\\'s Encrypt' AND tags.raw: 'phishing'\"\n\n# Example: Using curl to check HTTP headers for clues (User-Agent, Server type)\ncurl -v https://malicious-c2.com\n</code></pre>\n\n<p><b>Use Case:</b> You have an IP address `192.0.2.1` that was briefly seen as a C2 for a malware variant. Using passive DNS, you discover it previously hosted `fakebanklogin.com` and `anothermalwaredomain.net`. Checking CT logs for these domains reveals they all used the same self-signed certificate, suggesting the same actor. Reverse WHOIS on `fakebanklogin.com` reveals another set of domains registered with the same email, building a larger picture of the actor's infrastructure.</p>\n\n<p><b>Advice/Recommendation:</b> Always document actions taken and their timestamp. Ensure isolated systems can still be accessed by IR tools if needed. Maintain detailed notes on observed infrastructure, including IPs, domains, hosting providers, and timestamps. Use the 'Investigation Notes' or 'Multi-Vault' features in ThreatNet to keep track of all gathered data and their interconnections.</p>\n\n<p><b>Tips/Tricks:</b></p>\n<ul>\n  <li><b>Favicon Hashing:</b> Calculate the hash of a website's favicon. Many malicious sites (especially phishing kits) reuse favicons. Search Shodan for `http.favicon.hash:XXXX` to find other sites using the same favicon.</li>\n  <li><b>Google Dorks for Infrastructure:</b> Use `site:pastebin.com intext:\"ip-address\"` or `intitle:\"index of\" \"password.txt\"` for exposed files.</li>\n  <li><b>Reverse IP Lookup:</b> Use tools like `viewdns.info` to find other websites hosted on the same IP address.</li>\n  <li><b>DNS History:</b> Pay close attention to recent DNS changes for domains of interest; this can indicate a re-tooling or relocation of infrastructure.</li>\n</ul>\n\n<p><b>Alerts (What to be Safe From):</b></p>\n<ul>\n  <li><b>Active Connections:</b> Avoid directly connecting to suspicious IPs or domains without proper sandboxing or proxying. Do not browse potentially malicious sites from your primary workstation.</li>\n  <li><b>Honeypots:</b> Be aware that some malicious infrastructure might be honeypots set up by law enforcement or researchers to trap investigators. Always maintain good OpSec.</li>\n  <li><b>Data Overload:</b> Footprinting can generate a massive amount of data. Focus on identifying patterns and unique identifiers rather than trying to analyze every single piece of information.</li>\n  <li><b>False Positives:</b> Not every domain or IP linked to a suspicious entity is malicious. Verify findings through multiple sources and analyze context.</li>\n</ul>",
            "tags": ["osint", "cybercrime", "domain-investigation", "ip-footprinting", "network-analysis", "whois", "dns", "ssl", "tools", "best-practice", "opsec", "infrastructure"],
            "references": "WHOIS, Passive DNS, Censys, Shodan, crt.sh, Archive.org, ViewDNS.info, AbuseIPDB, RiskIQ PassiveTotal, Farsight DNSDB",
            "createdAt": 1700000005003,
            "updatedAt": 1700000005003
          },
          {
            "id": 10030103,
            "title": "1.3 Social Media Profile Analysis",
            "content": "<h3>Objective:</h3>\nTo extract intelligence from public social media profiles, understanding a cybercriminal's connections, interests, habits, and potentially identifying real-world links. This goes beyond simple username checks to deep content analysis.\n\n<h3>Key Analysis Areas:</h3>\n<ol>\n  <li><b>Profile Content & Posting History:</b>\n    <ul>\n      <li>Analyze public posts, comments, likes, and shares. Look for language patterns, slang, political views, hobbies, location tags, and times of activity.</li>\n      <li>Identify specific tools or techniques mentioned, complaints about law enforcement, or discussions about illicit activities (even if coded).</li>\n      <li>Pay attention to seemingly innocuous details that might align with other data points (e.g., a specific brand of computer, a pet's name).</li>\n    </ul>\n  </li>\n  <li><b>Network & Connections:</b>\n    <ul>\n      <li>Map out friends, followers, mutual connections, and groups joined. Cybercriminals often interact with associates or fellow criminals, sometimes inadvertently.</li>\n      <li>Look for overlapping connections between different aliases or suspected individuals.</li>\n      <li>Use network analysis tools (e.g., Maltego, Gephi) if the scale of connections warrants it.</li>\n    </ul>\n  </li>\n  <li><b>Media & Geolocation:</b>\n    <ul>\n      <li>Download and analyze images and videos posted. Check metadata for camera type, timestamps, or GPS coordinates (though often stripped).</li>\n      <li>Visually inspect backgrounds for unique landmarks, street signs, weather patterns, or local details that could pinpoint a location.</li>\n      <li>Look for check-ins, tagged locations, or mentions of specific places.</li>\n    </ul>\n  </li>\n  <li><b>Behavioral Patterns & OPSEC Indicators:</b>\n    <ul>\n      <li>Note times of activity: Do they align with typical work hours in a certain timezone? Are they active late at night?</li>\n      <li>Observe language changes (e.g., shifting from fluent English to broken English, suggesting use of translation tools or a non-native speaker).</li>\n      <li>Look for inconsistencies across profiles, or signs of poor operational security (e.g., using the same profile picture across professional and illicit accounts, revealing too much personal info).</li>\n    </ul>\n  </li>\n  <li><b>Cross-Platform Correlation:</b>\n    <ul>\n      <li>Once a profile is found, search for the profile's displayed name, bio text, or unique phrases on other social media sites or forums.</li>\n      <li>Look for linked accounts (e.g., Twitter profile linking to an Instagram account).</li>\n    </ul>\n  </li>\n</ol>\n\n<p><b>Use Case:</b> A suspected scammer frequently posts selfies from what appears to be a specific city. By analyzing background details like unique building facades, local transportation, or typical street scenes, you can narrow down the geographical area. Cross-referencing their posting times with the timezone of that city can reinforce the finding. Observing their comments on specific cybercrime forums might reveal technical skills or ongoing campaigns they are involved in.</p>\n\n<p><b>Advice/Recommendation:</b> Consider creating a 'persona' for social media reconnaissance (a fake but believable profile) for passive monitoring without directly engaging. However, be extremely cautious not to break platform terms of service or impersonate. Ethical considerations are paramount here. Always prioritize legal compliance.</p>\n\n<p><b>Tips/Tricks:</b></p>\n<ul>\n  <li><b>Facebook Graph Search (Limited):</b> While direct Graph Search is mostly gone, some third-party tools or careful dorking can still reveal public information about friends, likes, and groups.</li>\n  <li><b>Follower/Following Analysis:</b> Who are they following? Who follows them? Look for patterns: other known threat actors, specific political groups, or technical communities.</li>\n  <li><b>Language Analysis:</b> Use online translation tools to identify possible native languages based on subtle grammatical errors in English posts.</li>\n  <li><b>Sentiment Analysis:</b> Analyze the tone of their posts. Are they boastful, frustrated, cautious? This can provide psychological insights.</li>\n</ul>\n\n<p><b>Alerts (What to be Safe From):</b></p>\n<ul>\n  <li><b>Profile Traps:</b> Some malicious actors might set up fake profiles as honeypots to identify and track investigators. Be cautious about accepting friend requests or engaging directly.</li>\n  <li><b>Malicious Downloads:</b> Never download files or click links shared on suspicious social media profiles without extreme caution and sandboxing.</li>\n  <li><b>Doxing:</b> Be careful not to inadvertently dox yourself or other innocent individuals during broad social media sweeps.</li>\n  <li><b>Legal & Ethical Violations:</b> Do not engage in any activity that could be considered hacking, unauthorized access, impersonation (without explicit legal authorization), or harassment. Respect privacy boundaries and public data only.</li>\n</ul>",
            "tags": ["osint", "cybercrime", "social-media", "reconnaissance", "geolocation", "opsec", "tools", "best-practice", "behavioral-analysis"],
            "references": "Maltego, Gephi, Google Images, TinEye, Yandex, PimEyes, Archive.org, various social media platforms",
            "createdAt": 1700000005004,
            "updatedAt": 1700000005004
          },
          {
            "id": 10030104,
            "title": "1.4 Forum & Community Reconnaissance",
            "content": "<h3>Objective:</h3>\nTo identify relevant online forums (both legitimate and underground), monitor discussions, and extract valuable intelligence from user interactions, particularly those frequented by cybercriminals.\n\n<h3>Methodologies:</h3>\n<ol>\n  <li><b>Forum Identification:</b>\n    <ul>\n      <li><b>Keywords & Google Dorking:</b> Use specific keywords related to cybercrime (e.g., 'carding forum', 'ransomware negotiation', 'exploit marketplace') combined with Google Dorks like `inurl:forum` or `site:boards.net` to find relevant forums.</li>\n      <li><b>OSINT Resources:</b> Consult existing lists of dark web markets, cybercrime forums, or 'top hacker forums' compiled by security researchers (e.g., Flashpoint, Recorded Future threat reports).</li>\n      <li><b>Link Analysis:</b> Follow links from other suspicious sites or intelligence reports that point to forum discussions.</li>\n    </ul>\n  </li>\n  <li><b>Monitoring & Content Extraction (Passive):</b>\n    <ul>\n      <li><b>Surface Web Forums:</b> For clearnet forums (e.g., some hacking communities, Reddit subreddits, Pastebin), use search functions and RSS feeds (if available) to monitor activity related to your target.</li>\n      <li><b>Dark Web Forums (Passive):</b> Utilize dark web indexing services (e.g., Ahmia, OnionScan reports) that scrape forum content without requiring direct access. This keeps your OpSec high.</li>\n      <li><b>Web Archiving:</b> Use tools like Archive.org or Archive.today to check if forum pages have been previously archived, revealing content that might have since been deleted.</li>\n      <li><b>Data Breach Collections:</b> Search breach data collections for forum usernames or email addresses. These sometimes include forum posts linked to the credentials.</li>\n    </ul>\n  </li>\n  <li><b>Profile Analysis on Forums:</b>\n    <ul>\n      <li>If you identify a user of interest, examine their profile page: join date, post count, signature, linked websites, reputation score, and any 'about me' sections.</li>\n      <li>Look for consistent aliases, PGP keys, or cryptocurrency addresses mentioned in their posts or profile.</li>\n      <li>Analyze their posting style, grammar, time zones of activity, and the specific topics they engage with.</li>\n    </ul>\n  </li>\n  <li><b>Threat Actor Marketing/Recruitment:</b>\n    <ul>\n      <li>Cybercriminals often use forums to advertise services (e.g., DDoS for hire, malware sales), recruit affiliates, or sell stolen data.</li>\n      <li>Look for threads detailing specific campaigns, tools, or victim industries. This can provide valuable intelligence on TTPs.</li>\n    </ul>\n  </li>\n</ol>\n\n<p><b>Use Case:</b> You are investigating a new ransomware variant. Search known cybercrime forums for discussions about this ransomware, its developers, or its affiliates. You might find threads where the ransomware is being sold, support discussions, or victims seeking help, all of which can provide valuable intelligence on the actors and their network.</p>\n\n<p><b>Advice/Recommendation:</b> Prioritize passive reconnaissance (reading without interacting) to maintain your OpSec. Only engage (e.g., create an account) if absolutely necessary and with strict anonymity measures. Always assume anything you post on such forums could be used against you.</p>\n\n<p><b>Tips/Tricks:</b></p>\n<ul>\n  <li><b>Specific Keywords:</b> Beyond general terms, use specific malware names, tool names, or even unique error messages seen in incidents to find targeted discussions.</li>\n  <li><b>Forum Signatures:</b> Many users, especially long-term ones, put significant information (e.g., other aliases, social media links, PGP keys) in their forum signatures.</li>\n  <li><b>Post Timestamps:</b> Observe the timestamps of posts. This can reveal the time zones in which the actor operates.</li>\n  <li><b>Image/Link Hosting:</b> Pay attention to external image or file hosting services used in forum posts. These might reveal additional infrastructure or data.</li>\n</ul>\n\n<p><b>Alerts (What to be Safe From):</b></p>\n<ul>\n  <li><b>Malware:</b> Cybercrime forums are hotbeds for malware. Do not download any executables, scripts, or suspicious files directly from these sites. Assume anything offered is malicious.</li>\n  <li><b>Doxing Attempts:</b> Other forum users might attempt to identify you if they suspect you are an investigator. Protect your real identity rigorously.</li>\n  <li><b>Legal Ramifications:</b> Be acutely aware of the laws regarding accessing or possessing certain types of content (e.g., child exploitation material, illegal narcotics) that might be discussed or advertised on such forums. Report illegal content to the appropriate authorities.</li>\n  <li><b>Deception:</b> Information on forums can be deceptive. Cybercriminals often boast, lie, or use misdirection. Corroborate all information from multiple sources.</li>\n</ul>",
            "tags": ["osint", "cybercrime", "forums", "communities", "dark-web-recon", "reconnaissance", "opsec", "tools", "best-practice"],
            "references": "Ahmia, OnionScan, Archive.org, Archive.today, Flashpoint, Recorded Future",
            "createdAt": 1700000005005,
            "updatedAt": 1700000005005
          },
          {
            "id": 10030105,
            "title": "1.5 Document & File Metadata Analysis",
            "content": "<h3>Objective:</h3>\nTo extract hidden information embedded within public documents and files that could reveal details about their creator, source, software used, or even geographic location.\n\n<h3>Common File Types for Analysis:</h3>\n<ul>\n  <li><b>PDF Documents:</b> Often contain author, creation date, modification history, and software used.</li>\n  <li><b>Microsoft Office Documents (.docx, .xlsx, .pptx):</b> Rich in metadata including author, company, last saved by, total editing time, and template path.</li>\n  <li><b>Images (JPEG, PNG):</b> EXIF data can contain camera model, date/time taken, and sometimes GPS coordinates.</li>\n  <li><b>Audio/Video Files:</b> Can contain metadata about creation software, device, and sometimes location.</li>\n</ul>\n\n<h3>Tools & Techniques:</h3>\n<ol>\n  <li><b>ExifTool:</b> A powerful command-line tool for reading, writing, and editing meta information in a wide variety of files. Essential for detailed EXIF, PDF, and Office document metadata. \n<pre><code class=\"language-bash\">\nexiftool image.jpg\nexiftool -s document.pdf\n</code></pre>\n  </li>\n  <li><b>Online Metadata Viewers:</b> Websites like `metadata2go.com` or `fotoforensics.com` (for images) offer quick analysis without local tools. Useful for initial triage but be cautious with sensitive files.</li>\n  <li><b>Document Inspectors (Built-in):</b> Microsoft Office and Adobe Acrobat Pro have built-in document inspectors to view and remove metadata. These can also be used to *view* the metadata of received documents.</li>\n  <li><b>Strings Utility:</b> For non-standard files or binaries, `strings` can extract human-readable text, which might contain hardcoded paths, usernames, or other clues. \n<pre><code class=\"language-bash\">\nstrings suspicious_file.exe | grep -E 'C:\\\\Users|\\.local|\"\\\\Program Files\"'\n</code></pre>\n  </li>\n</ol>\n\n<p><b>Use Case:</b> A cybercriminal posts a 'proof-of-concept' malware document on a forum. Analyzing the document's metadata reveals the author's username 'DarkH4cker' and that it was created with a specific version of Microsoft Word on a machine with a German language pack. This provides a new alias and a potential geographic clue.</p>\n\n<p><b>Advice/Recommendation:</b> Always download suspicious files into a secure, isolated environment (e.g., a dedicated VM with network segmentation) before performing any analysis. Do not open or execute files directly. Prioritize the use of offline or command-line tools for sensitive metadata extraction to avoid exposing data to third-party online services.</p>\n\n<p><b>Tips/Tricks:</b></p>\n<ul>\n  <li><b>Timestamps:</b> Compare creation, modification, and last accessed timestamps across multiple files from the same source. Inconsistencies or patterns can be revealing.</li>\n  <li><b>Software Signatures:</b> Note the software used to create/modify the document. This might narrow down the actor's operating system or preferred tools.</li>\n  <li><b>Printer Information:</b> Some scanned documents or PDFs retain metadata about the printer used, including its model or network name.</li>\n  <li><b>Template Paths:</b> Microsoft Office documents can reveal the full path to the template used to create them, sometimes including usernames or network shares.</li>\n</ul>\n\n<p><b>Alerts (What to be Safe From):</b></p>\n<ul>\n  <li><b>Malicious Payloads:</b> Documents shared by cybercriminals often contain embedded malware (macros, exploits). Never enable macros or open suspicious files without extreme caution in a sandbox.</li>\n  <li><b>Honeypot Data:</b> Attackers may intentionally embed misleading metadata to mislead investigators. Corroborate findings with other intelligence.</li>\n  <li><b>Privacy Risks:</b> Be aware that if you're analyzing sensitive files from victims, you must handle them with utmost care to protect privacy and comply with data handling regulations.</li>\n  <li><b>Online Tool Risks:</b> Uploading sensitive or suspicious files to online metadata analysis tools may inadvertently expose the file or its contents to third parties.</li>\n</ul>",
            "tags": ["osint", "metadata", "file-analysis", "digital-forensics", "reconnaissance", "tools", "opsec", "best-practice"],
            "references": "ExifTool, metadata2go.com, fotoforensics.com, strings utility",
            "createdAt": 1700000005006,
            "updatedAt": 1700000005006
          },
          {
            "id": 10030106,
            "title": "1.6 Open-Source Code Repositories",
            "content": "<h3>Objective:</h3>\nTo identify relevant code, scripts, credentials, or developer profiles on public code hosting platforms that may be linked to cybercriminal activity or individuals.\n\n<h3>Key Platforms & Search Strategies:</h3>\n<ol>\n  <li><b>GitHub:</b> The largest code hosting platform. Search for:\n    <ul>\n      <li><b>Keywords:</b> `ransomware`, `exploit`, `c2`, `phishing kit`, `malware source`</li>\n      <li><b>Specific Indicators:</b> IP addresses, domains, email addresses, or usernames found in other parts of your investigation.</li>\n      <li><b>API Keys/Credentials:</b> Look for `password:`, `api_key=`, `secret=`, `token:` in code. Many accidental leaks occur here.</li>\n      <li><b>User Profiles:</b> Analyze user profiles for connections, starred repositories, and commit history. Look for profiles that are otherwise inactive but have recent commits related to suspicious activities.</li>\n    </ul>\n  </li>\n  <li><b>GitLab, Bitbucket, Gitea:</b> Similar strategies apply. While smaller, they might host content not found on GitHub.\n  </li>\n  <li><b>Public Paste Sites (e.g., Pastebin, Gist):</b> Although not strictly 'code repositories', these are frequently used to paste code, logs, configurations, and leaked credentials. Automate monitoring for specific keywords or known IOCs.\n  </li>\n</ol>\n\n<h3>Advanced Search Operators & Dorks:</h3>\n<ul>\n  <li><b>GitHub Dorks:</b>\n    <ul>\n      <li>`filename:config.php password` (finds config files with 'password')</li>\n      <li>`org:company-name leaked_creds` (search within a specific organization)</li>\n      <li>`language:python \"import os\" \"key\"` (specific language and keywords)</li>\n      <li>`in:readme \"admin panel\"` (search within readme files)</li>\n    </ul>\n  </li>\n  <li><b>Google Dorks for Code Repositories:</b>\n    <ul>\n      <li>`site:github.com inurl:\"/config\" \"password\"`</li>\n      <li>`site:gitlab.com intext:\"admin_username\" filetype:yml`</li>\n    </ul>\n  </li>\n</ul>\n\n<pre><code class=\"language-bash\">\n# Example: GitHub CLI search for a specific C2 domain\ngh search repos --json url --q \"malicious-c2.com\"\n\n# Example: Searching for exposed AWS keys on GitHub (hypothetical, be careful)\ngh search code --json text --q \"AWS_ACCESS_KEY_ID AKIAI\" --in file\n</code></pre>\n\n<p><b>Use Case:</b> During an incident, you discover a custom malware. Searching GitHub for unique strings or function names from the malware might lead to its source code repository, potentially revealing the developer's identity, other projects, or associated malicious infrastructure. Finding hardcoded C2 IPs in the source code is a common win.</p>\n\n<p><b>Advice/Recommendation:</b> Be extremely cautious about what you clone or download. Assume any code linked to cybercriminals may contain malicious components. Use a disposable VM for all code review and execution. Treat any exposed credentials as compromised immediately and report them if they belong to an organization.</p>\n\n<p><b>Tips/Tricks:</b></p>\n<ul>\n  <li><b>Commit History:</b> Review the commit history of interesting repositories. Older commits might contain accidentally leaked data that was later removed.</li>\n  <li><b>Forks:</b> If a repository is a fork, investigate the original repository for more context or other related forks.</li>\n  <li><b>Issue Trackers:</b> Sometimes, discussions in issue trackers or pull requests can reveal insights into a developer's methods or objectives.</li>\n  <li><b>Automated Scanners:</b> For large-scale monitoring, consider tools like GitGuardian or TruffleHog that automate scanning for leaked secrets.</li>\n</ul>\n\n<p><b>Alerts (What to be Safe From):</b></p>\n<ul>\n  <li><b>Malicious Code:</b> Never execute downloaded code directly on your primary system. Always use a sandboxed environment for analysis.</li>\n  <li><b>Accidental Compromise:</b> Cloning repositories can sometimes introduce risks if the repository contains malicious `.git` hooks or other hidden components. Use tools like `git-bomb-detector`.</li>\n  <li><b>Legal & Ethical Boundaries:</b> Do not attempt to exploit vulnerabilities found in public repositories unless you have explicit permission (e.g., through a bug bounty program).</li>\n  <li><b>False Attribution:</b> Just because a piece of code is on GitHub doesn't mean the owner is the cybercriminal. It might be a victim's code, or a researcher's, or a copy. Corroborate.</li>\n</ul>",
            "tags": ["osint", "code-analysis", "github", "reconnaissance", "data-leak", "tools", "opsec", "best-practice"],
            "references": "GitHub, GitLab, Bitbucket, Pastebin, Gist, GitGuardian, TruffleHog",
            "createdAt": 1700000005007,
            "updatedAt": 1700000005007
          }
        ]
      }
    ]
  }
]